# 14. 그룹화

그룹화를 하는 이유: 동일한 값을 가진 것들끼리 합쳐서 통계 또는 평균 등의 값을 계산하기 위해 사용

In [1]:
import pandas as pd
df = pd.read_csv('score.csv',index_col='지원번호')
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197   90   85  100  95  85      Python
2번    정대만  북산고  184   40   35   50  55  25        Java
3번    송태섭  북산고  168   80   75   70  80  75  Javascript
4번    서태웅  북산고  187   40   60   70  75  80         NaN
5번    강백호  북산고  188   15   20   10  35  10         NaN
6번    변덕규  능남고  202   80  100   95  85  80           C
7번    황태산  능남고  188   55   65   45  40  35      PYTHON
8번    윤대협  능남고  190  100   85   90  95  95          C#

In [3]:
df.groupby('학교')

## dfGroupBy객체.get_group(인덱스 라벨) : 해당 그룹을 반환한다.

In [7]:
booksan = df.groupby('학교').get_group('북산고')
booksan

       이름   학교    키  국어  영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197  90  85  100  95  85      Python
2번    정대만  북산고  184  40  35   50  55  25        Java
3번    송태섭  북산고  168  80  75   70  80  75  Javascript
4번    서태웅  북산고  187  40  60   70  75  80         NaN
5번    강백호  북산고  188  15  20   10  35  10         NaN

In [8]:
nn = df.groupby('학교').get_group('능남고')
nn

       이름   학교    키   국어   영어  수학  과학  사회    SW특기
지원번호
6번    변덕규  능남고  202   80  100  95  85  80       C
7번    황태산  능남고  188   55   65  45  40  35  PYTHON
8번    윤대협  능남고  190  100   85  90  95  95      C#

In [9]:
df.groupby('학교').mean()

C:\Users\songkyu\AppData\Local\Temp\ipykernel_9284\1605946280.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('학교').mean()

              키         국어         영어         수학         과학    사회
학교
능남고  193.333333  78.333333  83.333333  76.666667  73.333333  70.0
북산고  184.800000  53.000000  55.000000  60.000000  68.000000  55.0

In [11]:
df.groupby('학교').size() # 각 그룹의 크기

학교
능남고    3
북산고    5
dtype: int64

In [13]:
df.groupby('학교').size()['능남고'] #학교로 그룹화를 한 뒤에 능남고에 해당하는 데이터의 수 확인

3

In [15]:
df.groupby('학교')['키'].mean() #학교로 그룹화를 한 뒤에 학교별 평균 키 구하기

학교
능남고    193.333333
북산고    184.800000
Name: 키, dtype: float64

In [20]:
df.groupby('학교')[['키','국어','영어','수학']].mean().round(1)

         키    국어    영어    수학
학교
능남고  193.3  78.3  83.3  76.7
북산고  184.8  53.0  55.0  60.0

In [22]:
df['학년'] = [3,3,2,1,1,3,2,2]
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기  학년
지원번호
1번    채치수  북산고  197   90   85  100  95  85      Python   3
2번    정대만  북산고  184   40   35   50  55  25        Java   3
3번    송태섭  북산고  168   80   75   70  80  75  Javascript   2
4번    서태웅  북산고  187   40   60   70  75  80         NaN   1
5번    강백호  북산고  188   15   20   10  35  10         NaN   1
6번    변덕규  능남고  202   80  100   95  85  80           C   3
7번    황태산  능남고  188   55   65   45  40  35      PYTHON   2
8번    윤대협  능남고  190  100   85   90  95  95          C#   2

In [25]:
df.groupby(['학교','학년']).mean() # '학교별, 학년별' 평균 데이터

C:\Users\songkyu\AppData\Local\Temp\ipykernel_9284\3389283938.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(['학교','학년']).mean() # '학교별, 학년별' 평균 데이터

            키    국어     영어    수학    과학    사회
학교  학년
능남고 2   189.0  77.5   75.0  67.5  67.5  65.0
    3   202.0  80.0  100.0  95.0  85.0  80.0
북산고 1   187.5  27.5   40.0  40.0  55.0  45.0
    2   168.0  80.0   75.0  70.0  80.0  75.0
    3   190.5  65.0   60.0  75.0  75.0  55.0

In [26]:
df.groupby('학년').mean().sort_values('키')

C:\Users\songkyu\AppData\Local\Temp\ipykernel_9284\1768854921.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('학년').mean().sort_values('키')

             키         국어         영어         수학         과학         사회
학년
2   182.000000  78.333333  75.000000  68.333333  71.666667  68.333333
1   187.500000  27.500000  40.000000  40.000000  55.000000  45.000000
3   194.333333  70.000000  73.333333  81.666667  78.333333  63.333333

In [33]:
# 학교별로 SW특기별로 몇 명이 있는지 구하라
df.groupby(['학교','SW특기'])['이름'].count()

학교   SW특기
능남고  C             1
     C#            1
     PYTHON        1
북산고  Java          1
     Javascript    1
     Python        1
Name: 이름, dtype: int64

In [35]:
school = df.groupby('학교')
school['학년'].value_counts() # 학교로 그룹화한 뒤에 학년별 학생 수 조회

학교   학년
능남고  2     2
     3     1
북산고  1     2
     3     2
     2     1
Name: 학년, dtype: int64

In [36]:
school['학년'].value_counts().loc['북산고']

학년
1    2
3    2
2    1
Name: 학년, dtype: int64

In [43]:
school['학년'].value_counts().loc['능남고']

학년
2    2
3    1
Name: 학년, dtype: int64

In [45]:
school['학년'].value_counts(normalize=True).loc['북산고']
# 학생들의 수 데이터를 퍼센트로 비교하여 가져옴

학년
1    0.4
3    0.4
2    0.2
Name: 학년, dtype: float64